"use strict"

alert("Hello world!")

/*
много
строк
коммента.
*/

// comment
//* important comment
//! alert comment
//? queries comments
//TODO comment todo

// *Создайте переменную num и присвойте ей значение 123. Выведите значение этой переменной на экран с помощью функции alert.

let a = 123;

alert(a);

let b = 1,
    c = 2,
    d = 3;

// *оздайте переменную g. Запишите в нее значение 10, выведите его на экран. Затем запишите в нее значение 20, выведите его на экран.

let g = 10;

alert(g);

g = 20;

alert(g);

// *Создайте переменную l. Запишите в нее сумму чисел 1, 2 и 3. С помощью функции alert выведите на экран содержимое переменной a.

let l = 1 + 2 + 3;

console.log(l);

l = 1 - 2 - 3;

console.log(l);

l = 1 * 2 * 3;

console.log(l);

l = 1 / 2 / 3;

console.log(l);

// !Математические операции с переменными в JavaScript